[{
  "_id": {
    "$oid": "655817917ecf3448a7fa8549"
  },
  "user": "JuanDelaCru5",
  "op": true,
  "title": "Baldur's Gate III Lore and Story Discussion",
  "shortDesc": "Dive deep into the lore and story of Baldur's Gate III. Share your theories, speculations, and favorite moments from the game.",
  "content": "<p>Who would've expected that the lounge's resident goofball is into d e e p l o r e?</p><p>Ahem.</p><p>I'm going to discuss what we know so far about Baldur's Gate III.</p><h3>Is BG3 a sequel?</h3>Yes. The story takes place 100 years after the events in Baldur’s Gate 2 and shortly after the events of Descent into Avernus. I'm going to assume the rest of you didn't play the game yet, so I won't spoil anything yet.<h3>How is BG3 connected to DnD?</h3>Baldur’s Gate 3 takes place right after the events of Descent into Avernus. The holy city of Elturel disappeared from the Forgotten Realms and descended into Avernus, the first layer of the Nine Hells.<p>So basically, this game is based on the 5th edition ruleset of DnD and (correct me if I'm wrong) made together with Wizards of the Closet.</p>",
  "points": 333,
  "timePosted": "2023-08-03, 9:53 PM"
},
{
  "_id": {
    "$oid": "655826197ecf3448a7fa854d"
  },
  "user": "shrek13",
  "op": true,
  "title": "Counter-Strike 2 Strategy and Discussion",
  "shortDesc": "Looking to up your game in Counter-Strike 2? Share your best strategies, tips, and tricks!",
  "content": "<p>Hello, Level Up Loungers!</p><p>I made this thread so me and you guys can share some tips for Counter-Strike 2! I'll go first:</p><ul><li>Rejoice, CS:GO players. Not much changed from CS:GO, honestly, so your strategies may apply here.</li><li>Did you know: CS2's fancy new lighting effects can make your shadow look like your actual player character! Use this neat trick to fool your enemies.</li></ul><p>I'm curious with the tips you guys can come up with.</p>",
  "points": 4554,
  "timePosted": "2023-09-29, 12:29 AM"
},
{
  "_id": {
    "$oid": "655826197ecf3448a7fa854e"
  },
  "user": "popcat",
  "op": true,
  "title": "Minecraft Building Showcase",
  "shortDesc": "Show off your incredible Minecraft creations here! Whether it's massive castles, intricate redstone contraptions, or beautiful landscapes, we want to see it.",
  "content": "Figured it's about time someone made a Minecraft building thread. XD<br>Unfortunately I heard there's no image uploads yet, so you might wanna post image links instead for now. Crossing my fingers that we'll get image uploads soon!!",
  "points": 4376,
  "timePosted": "2022-11-09, 12:29 PM"
},
{
  "_id": {
    "$oid": "655826197ecf3448a7fa854f"
  },
  "user": "mco_taker",
  "op": true,
  "title": "Valorant Competitive Team Recruitment",
  "shortDesc": "Are you an aspiring Valorant pro looking for teammates? Join this thread to find like-minded players to form a competitive team.",
  "content": "Hi guys, it's ya boi with the new Valorant recruitment page! Just comment below to join my new team.",
  "points": 4545,
  "timePosted": "2021-12-23, 5:30 AM"
},
{
  "_id": {
    "$oid": "655826197ecf3448a7fa8551"
  },
  "user": "mco_taker",
  "op": true,
  "title": "League of Legends Patch 13.20 Discussion",
  "shortDesc": "Discuss the latest changes and updates in League of Legends Patch 13.20. Share your thoughts on balance changes, new skins, and champion updates.",
  "content": "Hello there! I've heard that Riot added some features that may enhance teamwork between players. Though, as a veteran LoL player, I highly doubt that'll cut down on the infamously toxic attitude of LoL players. (lol)<br>What do you guys think?",
  "points": 1324,
  "timePosted": "2023-02-27, 2:02 PM"
},
{
  "_id": {
    "$oid": "655826197ecf3448a7fa8552"
  },
  "user": "shrek13",
  "op": true,
  "title": "Upcoming Counter-Strike 2 Tournament",
  "shortDesc": "Stay updated on the upcoming Counter-Strike 2 tournament with this thread. Get all the details on teams, schedules, and prizes.",
  "content": "Hello hello! This is pretty much a thread where me and other loungers can post the latest updates on CS2 tournaments. Hype trains are also welcome. (This is also my chance for me to ask you guys to check out my CS2 strategy post.)",
  "points": 23,
  "timePosted": "2023-11-18, 10:42 AM"
},
{
  "_id": {
    "$oid": "655826197ecf3448a7fa8553"
  },
  "user": "popcat",
  "op": true,
  "title": "Minecraft Version 1.20.3 Preview",
  "shortDesc": "Exciting news, Minecraft fans! Check out what's coming in the highly-anticipated Version 1.20.3 update. Share your expectations and speculations.",
  "content": "It's been a while since I've touched Minecraft. (Uni has been tough lately.) But hey, I'm just in time for the latest update! Apparently, shields would be improved, bats will get a new look, and decorated pots would get more functions. As an avid Creative Mode player, I'm so hyped!",
  "points": 54,
  "timePosted": "2023-11-17, 8:43 AM"
},
{
  "_id": {
    "$oid": "655826197ecf3448a7fa8554"
  },
  "user": "mco_taker",
  "op": true,
  "title": "Valorant Battle Pass for Episode 7 Act 3 is Now Live",
  "shortDesc": "Episode 7 Act 3 of Valorant's Battle Pass is here! Discuss the new skins, agents, and challenges in this thread.",
  "content": "",
  "points": 13,
  "timePosted": "2023-11-16, 2:00 PM"
},
{
  "_id": {
    "$oid": "655826197ecf3448a7fa8555"
  },
  "user": "JuanDelaCru5",
  "op": true,
  "title": "Baldur's Gate III Mod Showcase",
  "shortDesc": "Discover the latest and greatest mods for Baldur's Gate III in this thread. Share your favorite mods and experiences with the community.",
  "content": "___",
  "points": 21,
  "timePosted": "2023-11-15, 4:56 PM"
},
{
  "_id": {
    "$oid": "655826197ecf3448a7fa8556"
  },
  "user": "shrek13",
  "op": true,
  "title": "League of Legends Esports Recap",
  "shortDesc": "Missed the latest League of Legends esports matches? Get a recap of the action, standout plays, and results in this thread.",
  "content": "___",
  "points": 43,
  "timePosted": "2023-10-30, 3:46 PM"
},
{
  "_id": {
    "$oid": "655b532fae772843a5386f0f"
  },
  "user": "JuanDelaCru5",
  "op": true,
  "title": "Sample Post",
  "shortDesc": "This is a test post.",
  "content": "Hello world!",
  "points": 0,
  "timePosted": "2023-11-20T12:38:07.708Z",
  "createdAt": {
    "$date": "2023-11-20T12:38:07.713Z"
  },
  "updatedAt": {
    "$date": "2023-11-20T12:38:07.713Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "655b5df47f9fdab669c0f55d"
  },
  "user": "mco_taker",
  "content": "<p>Welcome to<b>LevelUpLounge</b>, your corner for video games and more!</p><ul><li>As much as possible, keep your posts and comments related to video games and any other similar topics. Unrelated topics such as religion, politics, etc. may be removed.</li><li>Users are not allowed to disclose personal information for their own safety. Revealing another user’s personal information will merit a<b>permanent ban</b>for those involved.</li><li>Do not harass any other forum users, including moderators and other staff. It’s okay to express your opinion, but keep it civil.</li><li>Hate speech is not permitted. Posting or commenting about hate speech will result in a<b>permanent ban</b>.</li><li>Refrain from bumping up threads just for the sake of it. Non-productive comments not related to the topic at hand will be removed.</li><li>Self-promotion of personal products, materials, etc. is not allowed. Posts containing such content will be edited or deleted.</li><li>Illegal activity such as piracy is not allowed.</li><li>Linking to files which contain viruses or malware will result in a<b>permanent ban</b>.</li></ul>",
  "title": "Forum Rules",
  "shortDesc": "Please read our forum rules before posting or commenting!",
  "points": 9000,
  "timePosted": "2022-01-20, 10:39 PM",
  "community": true
},
{
  "_id": {
    "$oid": "655b5f0e7f9fdab669c0f55f"
  },
  "user": "nodJS",
  "content": "<p>This is where you can give us any suggestions to improve the forums, or ask any other related questions.</p><h4>Some rules</h4><ul><li>Please be patient for new features to be added. We are humans, not machines.</li><li>For technical issues, contact the devs through the help page.</li></ul>",
  "op": true,
  "title": "Forum Features and Feedback",
  "shortDesc": "Feel free to post any questions you have about the forum, or suggestions on how we can improve.",
  "points": 2678,
  "timePosted": "2022-02-04, 11:31 AM",
  "community": true
}]